# - "1st program"
print((9**0.5)*5)
# - "2nd program"
print(bool(9.99 > 9.98 and 1000 != 1000.1))
# - "3rd program"
print(((1234 % 1000) // 10) + ((5678 % 1000) // 10))
# - "4th program"
print(bool(int((13.42 // 1)) == int((((42.13 - (42.13 // 1)) * 100) // 1))) or (int((42.13 // 1)-1) == int((((13.42 - (13.42 // 1)) * 100) // 1))))
print(42.13 - (42.13 % 1))
print(bool(int((42.13 // 1)-1) == int((((13.42 - (13.42 // 1)) * 100) // 1)))) # - не работает сравнение, так как не целые числа получаются, пришлось пойти на хитрость
print(int(42.13 // 1))
print(((13.42 - (13.42 // 1)) * 100))
print(int(13.42 // 1))
print(int((13.42 - (13.42 // 1))*100))

